{"meta":{"title":"Gabriel Melo","subtitle":"A Data blog","description":"","author":"Gabriel M. de Melo","url":"https://gabrielmmelo.github.io","root":"/"},"pages":[{"title":"404","date":"2022-02-02T17:07:18.000Z","updated":"2022-02-02T19:31:43.073Z","comments":true,"path":"/404.html","permalink":"https://gabrielmmelo.github.io/404.html","excerpt":"","text":"Artigo não existe"},{"title":"About","date":"2022-02-02T18:56:20.093Z","updated":"2022-02-02T18:56:20.093Z","comments":true,"path":"about/index.html","permalink":"https://gabrielmmelo.github.io/about/index.html","excerpt":"","text":""},{"title":"Categories","date":"2022-02-02T18:56:20.093Z","updated":"2022-02-02T18:56:20.093Z","comments":true,"path":"categories/index.html","permalink":"https://gabrielmmelo.github.io/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2022-02-02T18:56:20.093Z","updated":"2022-02-02T18:56:20.093Z","comments":true,"path":"tags/index.html","permalink":"https://gabrielmmelo.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Spaced repetition","slug":"Spaced repetition","date":"2022-02-02T20:53:47.377Z","updated":"2022-02-02T20:54:29.647Z","comments":true,"path":"wiki/Spaced repetition/","link":"","permalink":"https://gabrielmmelo.github.io/wiki/Spaced%20repetition/","excerpt":"","text":"Spaced RepetitionA técnica de repetição espaçada é a utilizada por técnicas com os Flashcards. Motivação Um computador faz contas, de forma perfeita, por que nós humanos não conseguimos. Um computador armazena toneladas - peta ou zetabytes - de informações, enquanto nós esquecemos o que comemos no almoço. Isso é um fato. Não é sobre lembrarmos tudo que existe em um livro lido, mas sim lembrar que alguma coisa nele. E, desta forma, é possível alcançar a informação quista, através de palavras-chave mais assertivas para sua busca. A detenção da memória acontece de forma mais efetiva quando revisitamos o conteúdo estudado de forma espaçada, ao invés de uma estratégia massificada. O decaimento do aprendizado, ou a Curva do esquecimento, pode ser representado de forma análoga a uma Meia-vida radioativa: Uma revisão ativa, como a utilizada em Flashcards, traz melhores resultados quando comparada a métodos de simples exposição a informação. O método de espaçamento é escalável para uma quantidade gigantesca de informação (como utilizado por profissionais de medicina, participantes de competições como Jeopardy! e estudantes de línguas estrangeiras) A premissa sobre o método de repetição espaçada é a de que devemos revisar uma dada informação conforme formos a esquecendo. Isto é: antes que ocorra o completo esquecimento da mesma, mas que se distancie o suficiente da última revisão a ponto de ser necessário algum ‘esforço’ para lembrá-la. Em termos de sistematização, se, ao revisarmos o o conteúdo, temos um valor de 100% de detenção da memória e, ao esquecer por completo, temos 0%, um parâmetro satisfatório seria aplicar a revisão ao alcançar o 90%, como ilustrado na figura abaixo. Note que, devido a seu comportamento de “meia-vida”, o distanciamento entre as revisões se torna maior no decorrer do processo. Em outras palavras, as repetições devem se iniciar com maior frequência no início e irem assumindo maiores intervalos. Como, na prática, não é possível mensurarmos o exato status do decaimento de memória acerca de um tópico, são utilizados métodos aproximados, baseados na “dificuldade em se lembrar” de algo, para distanciar as revisões. Alguns softwares, como Anki, servem esse propósito, utilizando diferentes variações de um algoritmo base: … Não existe um melhor momento para fazer as reviews, contudo, existem evidências de que as informações absorvidas antes do sono tendem a ser melhor consolidadas. Referências https://www.gwern.net/Spaced-repetition","categories":[],"tags":[{"name":"notes","slug":"notes","permalink":"https://gabrielmmelo.github.io/tags/notes/"}]},{"title":"202107161454-projetos-antecedem-tarefas","slug":"202107161454-projetos-antecedem-tarefas","date":"2022-02-02T18:56:20.093Z","updated":"2022-02-02T18:56:20.093Z","comments":true,"path":"wiki/202107161454-projetos-antecedem-tarefas/","link":"","permalink":"https://gabrielmmelo.github.io/wiki/202107161454-projetos-antecedem-tarefas/","excerpt":"","text":"Projetos antecedem tarefasMeu instinto natural para lidar com atividades pessoais e, a princípio, corriqueiras, sempre foi listá-las com uma dada periodicidade (e.g. diária, semanal) e atacá-las com alguma prioridade definida no momento. Mesmo após aplicar agile com Scrum e Lean Kanban no meu contexto profissional, poucas vezes me questionei sobre a saúde do meu fluxo de resolução de tarefas pessoais, muito menos com a minha saúde psicológica para enfrentar isso. Durante a minha migração para o Obsidian 202107161521-por-que-migrei-para-o-obsidian , foi quando começei a ler sobre o 202107130803-para-method , um método proposto pelo Tiago Forte , um guru da produtividade. Ele propõe, basicamente, uma divisão física e cognitiva das informações (i.e. notas, pensamentos, assets, etc.) pela actionability de cada frente. Por exemplo, projetos tender a agregar mais conteúdo dinamicamente, durante o seu desenvolvimento. Em contrapartida, temos conteúdos arquivados que não têm utilização direta para o momento atual e, por isso, tem baixíssima dinamicidade, mas que não gostaríamos de deletá-los. Esse pensamento me fez refletir de forma orgânica, enquanto estruturava a minha variante do método do Forte, sobre o escopo dos projetos pessoais que tocava. Desde então, a minha abordagem foi de ter projetos cada vez menores (i.e. modularizados, como microserviços) e, não só por consequência, mais projetos desenhados. Além da redução de grandes projetos, isso me levou também a desenhar micro projetos advindos de pequenas tarefas do dia a dia que, a princípio, não pareciam relacionadas mas que quando conectadas trazem mais valor e geram mais insights - gerando mais tarefas (e.g. saída-empresa-x, chegada-empresa-y). Um ponto de atenção é que Isso não quer dizer que atuo em mais projetos simultaneamente. Particularmente, me sinto muito sobrecarregado e disperso quando tenho mais de 4 pequenos projetos em paralelo. see also:","categories":[],"tags":[{"name":"triage_no_anki","slug":"triage-no-anki","permalink":"https://gabrielmmelo.github.io/tags/triage-no-anki/"},{"name":"test","slug":"test","permalink":"https://gabrielmmelo.github.io/tags/test/"}]},{"title":"Hello World","slug":"hello-world","date":"2022-02-02T18:56:20.093Z","updated":"2022-02-02T18:56:20.093Z","comments":true,"path":"wiki/hello-world/","link":"","permalink":"https://gabrielmmelo.github.io/wiki/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment Teste","categories":[{"name":"teste","slug":"teste","permalink":"https://gabrielmmelo.github.io/categories/teste/"}],"tags":[]}],"categories":[{"name":"teste","slug":"teste","permalink":"https://gabrielmmelo.github.io/categories/teste/"}],"tags":[{"name":"notes","slug":"notes","permalink":"https://gabrielmmelo.github.io/tags/notes/"},{"name":"triage_no_anki","slug":"triage-no-anki","permalink":"https://gabrielmmelo.github.io/tags/triage-no-anki/"},{"name":"test","slug":"test","permalink":"https://gabrielmmelo.github.io/tags/test/"}]}